{
    "summary": "ResearchCoin (RSC) is a cryptocurrency token within the ResearchHub network designed to foster open participation in the scientific community. It incentivizes academics to share, curate, summarize, and discuss research openly. RSC rewards are based on community feedback and contributions, promoting collaboration and accelerating scientific progress. The platform addresses issues like paywalls and limited access to scholarly content by providing an open and decentralized space for knowledge sharing. ResearchHub functions as a community-driven platform where users earn RSC for valuable contributions such as sharing papers, curating content, and engaging in peer review. Governance is facilitated through the ResearchHub DAO, where RSC holders can vote on platform updates and funding proposals.",
  
    "token_utility": "ResearchCoin has a total supply of one billion tokens, with 20% allocated for community distribution. Users earn RSC by sharing research, curating content, summarizing research outputs, reviewing manuscripts, and participating in the platform. RSC holders gain voting rights in the ResearchHub DAO, enabling them to boost content, fund research proposals, and influence platform governance. The token’s utility also includes rewarding users for flagging copyright violations. RSC supports transparent and community-driven content curation, encouraging diverse participation and open access to research.",
  
    "risk_factors": "Challenges for ResearchCoin include addressing the dominance of academic publishers, facilitating open science participation, and managing the increasing volume of scholarly work. The platform aims to disrupt traditional journal models by incentivizing open collaboration and knowledge sharing. Risks include ensuring diverse opinions are expressed, avoiding centralization of curation power, and maintaining fair reward distribution. Governance through the ResearchHub DAO will be crucial in adapting to community needs and ensuring platform sustainability. Effective handling of content volume and peer feedback mechanisms will be key to maintaining quality and engagement over time.",
  
    "metadata": {
      "source": "The ResearchCoin Whitepaper",
      "project_name": "Research Coin",
      "word_count": 294
    }
  }
  
